MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F398VE/mcu.h
/******************  Bit definition for FMC_BWTR4 register  ******************/
#define FMC_BWTR4_ADDSET_Pos        (0U)                                       
#define FMC_BWTR4_ADDSET_Msk        (0xFUL << FMC_BWTR4_ADDSET_Pos)             /*!< 0x0000000F */
#define FMC_BWTR4_ADDSET            FMC_BWTR4_ADDSET_Msk                       /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define FMC_BWTR4_ADDSET_0          (0x1UL << FMC_BWTR4_ADDSET_Pos)             /*!< 0x00000001 */
#define FMC_BWTR4_ADDSET_1          (0x2UL << FMC_BWTR4_ADDSET_Pos)             /*!< 0x00000002 */
#define FMC_BWTR4_ADDSET_2          (0x4UL << FMC_BWTR4_ADDSET_Pos)             /*!< 0x00000004 */
#define FMC_BWTR4_ADDSET_3          (0x8UL << FMC_BWTR4_ADDSET_Pos)             /*!< 0x00000008 */

#define FMC_BWTR4_ADDHLD_Pos        (4U)                                       
#define FMC_BWTR4_ADDHLD_Msk        (0xFUL << FMC_BWTR4_ADDHLD_Pos)             /*!< 0x000000F0 */
#define FMC_BWTR4_ADDHLD            FMC_BWTR4_ADDHLD_Msk                       /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define FMC_BWTR4_ADDHLD_0          (0x1UL << FMC_BWTR4_ADDHLD_Pos)             /*!< 0x00000010 */
#define FMC_BWTR4_ADDHLD_1          (0x2UL << FMC_BWTR4_ADDHLD_Pos)             /*!< 0x00000020 */
#define FMC_BWTR4_ADDHLD_2          (0x4UL << FMC_BWTR4_ADDHLD_Pos)             /*!< 0x00000040 */
#define FMC_BWTR4_ADDHLD_3          (0x8UL << FMC_BWTR4_ADDHLD_Pos)             /*!< 0x00000080 */

#define FMC_BWTR4_DATAST_Pos        (8U)                                       
#define FMC_BWTR4_DATAST_Msk        (0xFFUL << FMC_BWTR4_DATAST_Pos)            /*!< 0x0000FF00 */
#define FMC_BWTR4_DATAST            FMC_BWTR4_DATAST_Msk                       /*!<DATAST [3:0] bits (Data-phase duration) */
#define FMC_BWTR4_DATAST_0          (0x01UL << FMC_BWTR4_DATAST_Pos)            /*!< 0x00000100 */
#define FMC_BWTR4_DATAST_1          (0x02UL << FMC_BWTR4_DATAST_Pos)            /*!< 0x00000200 */
#define FMC_BWTR4_DATAST_2          (0x04UL << FMC_BWTR4_DATAST_Pos)            /*!< 0x00000400 */
#define FMC_BWTR4_DATAST_3          (0x08UL << FMC_BWTR4_DATAST_Pos)            /*!< 0x00000800 */
#define FMC_BWTR4_DATAST_4          (0x10UL << FMC_BWTR4_DATAST_Pos)            /*!< 0x00001000 */
#define FMC_BWTR4_DATAST_5          (0x20UL << FMC_BWTR4_DATAST_Pos)            /*!< 0x00002000 */
#define FMC_BWTR4_DATAST_6          (0x40UL << FMC_BWTR4_DATAST_Pos)            /*!< 0x00004000 */
#define FMC_BWTR4_DATAST_7          (0x80UL << FMC_BWTR4_DATAST_Pos)            /*!< 0x00008000 */

#define FMC_BWTR4_CLKDIV_Pos        (20U)                                      
#define FMC_BWTR4_CLKDIV_Msk        (0xFUL << FMC_BWTR4_CLKDIV_Pos)             /*!< 0x00F00000 */
#define FMC_BWTR4_CLKDIV            FMC_BWTR4_CLKDIV_Msk                       /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define FMC_BWTR4_CLKDIV_0          (0x1UL << FMC_BWTR4_CLKDIV_Pos)             /*!< 0x00100000 */
#define FMC_BWTR4_CLKDIV_1          (0x2UL << FMC_BWTR4_CLKDIV_Pos)             /*!< 0x00200000 */
#define FMC_BWTR4_CLKDIV_2          (0x4UL << FMC_BWTR4_CLKDIV_Pos)             /*!< 0x00400000 */
#define FMC_BWTR4_CLKDIV_3          (0x8UL << FMC_BWTR4_CLKDIV_Pos)             /*!< 0x00800000 */

#define FMC_BWTR4_DATLAT_Pos        (24U)                                      
#define FMC_BWTR4_DATLAT_Msk        (0xFUL << FMC_BWTR4_DATLAT_Pos)             /*!< 0x0F000000 */
#define FMC_BWTR4_DATLAT            FMC_BWTR4_DATLAT_Msk                       /*!<DATLA[3:0] bits (Data latency) */
#define FMC_BWTR4_DATLAT_0          (0x1UL << FMC_BWTR4_DATLAT_Pos)             /*!< 0x01000000 */
#define FMC_BWTR4_DATLAT_1          (0x2UL << FMC_BWTR4_DATLAT_Pos)             /*!< 0x02000000 */
#define FMC_BWTR4_DATLAT_2          (0x4UL << FMC_BWTR4_DATLAT_Pos)             /*!< 0x04000000 */
#define FMC_BWTR4_DATLAT_3          (0x8UL << FMC_BWTR4_DATLAT_Pos)             /*!< 0x08000000 */

#define FMC_BWTR4_ACCMOD_Pos        (28U)                                      
#define FMC_BWTR4_ACCMOD_Msk        (0x3UL << FMC_BWTR4_ACCMOD_Pos)             /*!< 0x30000000 */
#define FMC_BWTR4_ACCMOD            FMC_BWTR4_ACCMOD_Msk                       /*!<ACCMOD[1:0] bits (Access mode) */
#define FMC_BWTR4_ACCMOD_0          (0x1UL << FMC_BWTR4_ACCMOD_Pos)             /*!< 0x10000000 */
#define FMC_BWTR4_ACCMOD_1          (0x2UL << FMC_BWTR4_ACCMOD_Pos)             /*!< 0x20000000 */

/******************  Bit definition for FMC_PCRx register  *******************/
#define FMC_PCRx_PWAITEN_Pos        (1U)                                       
#define FMC_PCRx_PWAITEN_Msk        (0x1UL << FMC_PCRx_PWAITEN_Pos)             /*!< 0x00000002 */
#define FMC_PCRx_PWAITEN            FMC_PCRx_PWAITEN_Msk                       /*!<Wait feature enable bit                   */
#define FMC_PCRx_PBKEN_Pos          (2U)                                       
#define FMC_PCRx_PBKEN_Msk          (0x1UL << FMC_PCRx_PBKEN_Pos)               /*!< 0x00000004 */
#define FMC_PCRx_PBKEN              FMC_PCRx_PBKEN_Msk                         /*!<PC Card/NAND Flash memory bank enable bit */
#define FMC_PCRx_PTYP_Pos           (3U)                                       
#define FMC_PCRx_PTYP_Msk           (0x1UL << FMC_PCRx_PTYP_Pos)                /*!< 0x00000008 */
#define FMC_PCRx_PTYP               FMC_PCRx_PTYP_Msk                          /*!<Memory type                               */

#define FMC_PCRx_PWID_Pos           (4U)                                       
#define FMC_PCRx_PWID_Msk           (0x3UL << FMC_PCRx_PWID_Pos)                /*!< 0x00000030 */
#define FMC_PCRx_PWID               FMC_PCRx_PWID_Msk                          /*!<PWID[1:0] bits (NAND Flash databus width) */
#define FMC_PCRx_PWID_0             (0x1UL << FMC_PCRx_PWID_Pos)                /*!< 0x00000010 */
#define FMC_PCRx_PWID_1             (0x2UL << FMC_PCRx_PWID_Pos)                /*!< 0x00000020 */

#define FMC_PCRx_ECCEN_Pos          (6U)                                       
#define FMC_PCRx_ECCEN_Msk          (0x1UL << FMC_PCRx_ECCEN_Pos)               /*!< 0x00000040 */
#define FMC_PCRx_ECCEN              FMC_PCRx_ECCEN_Msk                         /*!<ECC computation logic enable bit          */

#define FMC_PCRx_TCLR_Pos           (9U)                                       
#define FMC_PCRx_TCLR_Msk           (0xFUL << FMC_PCRx_TCLR_Pos)                /*!< 0x00001E00 */
#define FMC_PCRx_TCLR               FMC_PCRx_TCLR_Msk                          /*!<TCLR[3:0] bits (CLE to RE delay)          */
#define FMC_PCRx_TCLR_0             (0x1UL << FMC_PCRx_TCLR_Pos)                /*!< 0x00000200 */
#define FMC_PCRx_TCLR_1             (0x2UL << FMC_PCRx_TCLR_Pos)                /*!< 0x00000400 */
#define FMC_PCRx_TCLR_2             (0x4UL << FMC_PCRx_TCLR_Pos)                /*!< 0x00000800 */
#define FMC_PCRx_TCLR_3             (0x8UL << FMC_PCRx_TCLR_Pos)                /*!< 0x00001000 */

