MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F398VE/mcu.h
/********************  Bits definition for RTC_ALRMASSR register  *************/
#define RTC_ALRMASSR_MASKSS_Pos      (24U)                                     
#define RTC_ALRMASSR_MASKSS_Msk      (0xFUL << RTC_ALRMASSR_MASKSS_Pos)         /*!< 0x0F000000 */
#define RTC_ALRMASSR_MASKSS          RTC_ALRMASSR_MASKSS_Msk                   
#define RTC_ALRMASSR_MASKSS_0        (0x1UL << RTC_ALRMASSR_MASKSS_Pos)         /*!< 0x01000000 */
#define RTC_ALRMASSR_MASKSS_1        (0x2UL << RTC_ALRMASSR_MASKSS_Pos)         /*!< 0x02000000 */
#define RTC_ALRMASSR_MASKSS_2        (0x4UL << RTC_ALRMASSR_MASKSS_Pos)         /*!< 0x04000000 */
#define RTC_ALRMASSR_MASKSS_3        (0x8UL << RTC_ALRMASSR_MASKSS_Pos)         /*!< 0x08000000 */
#define RTC_ALRMASSR_SS_Pos          (0U)                                      
#define RTC_ALRMASSR_SS_Msk          (0x7FFFUL << RTC_ALRMASSR_SS_Pos)          /*!< 0x00007FFF */
#define RTC_ALRMASSR_SS              RTC_ALRMASSR_SS_Msk                       

/********************  Bits definition for RTC_ALRMBSSR register  *************/
#define RTC_ALRMBSSR_MASKSS_Pos      (24U)                                     
#define RTC_ALRMBSSR_MASKSS_Msk      (0xFUL << RTC_ALRMBSSR_MASKSS_Pos)         /*!< 0x0F000000 */
#define RTC_ALRMBSSR_MASKSS          RTC_ALRMBSSR_MASKSS_Msk                   
#define RTC_ALRMBSSR_MASKSS_0        (0x1UL << RTC_ALRMBSSR_MASKSS_Pos)         /*!< 0x01000000 */
#define RTC_ALRMBSSR_MASKSS_1        (0x2UL << RTC_ALRMBSSR_MASKSS_Pos)         /*!< 0x02000000 */
#define RTC_ALRMBSSR_MASKSS_2        (0x4UL << RTC_ALRMBSSR_MASKSS_Pos)         /*!< 0x04000000 */
#define RTC_ALRMBSSR_MASKSS_3        (0x8UL << RTC_ALRMBSSR_MASKSS_Pos)         /*!< 0x08000000 */
#define RTC_ALRMBSSR_SS_Pos          (0U)                                      
#define RTC_ALRMBSSR_SS_Msk          (0x7FFFUL << RTC_ALRMBSSR_SS_Pos)          /*!< 0x00007FFF */
#define RTC_ALRMBSSR_SS              RTC_ALRMBSSR_SS_Msk                       

/********************  Bits definition for RTC_BKP0R register  ****************/
#define RTC_BKP0R_Pos                (0U)                                      
#define RTC_BKP0R_Msk                (0xFFFFFFFFUL << RTC_BKP0R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP0R                    RTC_BKP0R_Msk                             

/********************  Bits definition for RTC_BKP1R register  ****************/
#define RTC_BKP1R_Pos                (0U)                                      
#define RTC_BKP1R_Msk                (0xFFFFFFFFUL << RTC_BKP1R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP1R                    RTC_BKP1R_Msk                             

/********************  Bits definition for RTC_BKP2R register  ****************/
#define RTC_BKP2R_Pos                (0U)                                      
#define RTC_BKP2R_Msk                (0xFFFFFFFFUL << RTC_BKP2R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP2R                    RTC_BKP2R_Msk                             

/********************  Bits definition for RTC_BKP3R register  ****************/
#define RTC_BKP3R_Pos                (0U)                                      
#define RTC_BKP3R_Msk                (0xFFFFFFFFUL << RTC_BKP3R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP3R                    RTC_BKP3R_Msk                             

/********************  Bits definition for RTC_BKP4R register  ****************/
#define RTC_BKP4R_Pos                (0U)                                      
#define RTC_BKP4R_Msk                (0xFFFFFFFFUL << RTC_BKP4R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP4R                    RTC_BKP4R_Msk                             

/********************  Bits definition for RTC_BKP5R register  ****************/
#define RTC_BKP5R_Pos                (0U)                                      
#define RTC_BKP5R_Msk                (0xFFFFFFFFUL << RTC_BKP5R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP5R                    RTC_BKP5R_Msk                             

/********************  Bits definition for RTC_BKP6R register  ****************/
#define RTC_BKP6R_Pos                (0U)                                      
#define RTC_BKP6R_Msk                (0xFFFFFFFFUL << RTC_BKP6R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP6R                    RTC_BKP6R_Msk                             

/********************  Bits definition for RTC_BKP7R register  ****************/
#define RTC_BKP7R_Pos                (0U)                                      
#define RTC_BKP7R_Msk                (0xFFFFFFFFUL << RTC_BKP7R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP7R                    RTC_BKP7R_Msk                             

/********************  Bits definition for RTC_BKP8R register  ****************/
#define RTC_BKP8R_Pos                (0U)                                      
#define RTC_BKP8R_Msk                (0xFFFFFFFFUL << RTC_BKP8R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP8R                    RTC_BKP8R_Msk                             

/********************  Bits definition for RTC_BKP9R register  ****************/
#define RTC_BKP9R_Pos                (0U)                                      
#define RTC_BKP9R_Msk                (0xFFFFFFFFUL << RTC_BKP9R_Pos)            /*!< 0xFFFFFFFF */
#define RTC_BKP9R                    RTC_BKP9R_Msk                             

/********************  Bits definition for RTC_BKP10R register  ***************/
#define RTC_BKP10R_Pos               (0U)                                      
#define RTC_BKP10R_Msk               (0xFFFFFFFFUL << RTC_BKP10R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP10R                   RTC_BKP10R_Msk                            

/********************  Bits definition for RTC_BKP11R register  ***************/
#define RTC_BKP11R_Pos               (0U)                                      
#define RTC_BKP11R_Msk               (0xFFFFFFFFUL << RTC_BKP11R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP11R                   RTC_BKP11R_Msk                            

/********************  Bits definition for RTC_BKP12R register  ***************/
#define RTC_BKP12R_Pos               (0U)                                      
#define RTC_BKP12R_Msk               (0xFFFFFFFFUL << RTC_BKP12R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP12R                   RTC_BKP12R_Msk                            

/********************  Bits definition for RTC_BKP13R register  ***************/
#define RTC_BKP13R_Pos               (0U)                                      
#define RTC_BKP13R_Msk               (0xFFFFFFFFUL << RTC_BKP13R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP13R                   RTC_BKP13R_Msk                            

/********************  Bits definition for RTC_BKP14R register  ***************/
#define RTC_BKP14R_Pos               (0U)                                      
#define RTC_BKP14R_Msk               (0xFFFFFFFFUL << RTC_BKP14R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP14R                   RTC_BKP14R_Msk                            

/********************  Bits definition for RTC_BKP15R register  ***************/
#define RTC_BKP15R_Pos               (0U)                                      
#define RTC_BKP15R_Msk               (0xFFFFFFFFUL << RTC_BKP15R_Pos)           /*!< 0xFFFFFFFF */
#define RTC_BKP15R                   RTC_BKP15R_Msk                            

